### Missing Values and Deleting Data points



### Step 1. Import the necessary libraries numpy, pandas etc

In [1]:
import numpy as np
import pandas as pd

### Step 2. Import the dataset *wine.txt* from this [address](https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data) or from the folder

In [2]:
wine = pd.read_table('wine.txt', sep=',',header = None)

### Step 3. Assign it to a variable called wine

Please note that the original data text file doesn't contain any header. Please ensure that when you import the data, you should use a suitable argument so as to avoid data getting imported as header.

In [3]:
wine.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
1,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
2,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
3,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
4,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735

### Step 4. Delete the first, fourth, seventh, nineth, eleventh, thirteenth and fourteenth columns

In [4]:
wine.drop(columns = [0,3,6,8,10,12,13], axis =1, inplace=True)

In [5]:
wine.head()

      1     2     4    5     7     9     11
0  14.23  1.71  15.6  127  3.06  2.29  1.04
1  13.20  1.78  11.2  100  2.76  1.28  1.05
2  13.16  2.36  18.6  101  3.24  2.81  1.03
3  14.37  1.95  16.8  113  3.49  2.18  0.86
4  13.24  2.59  21.0  118  2.69  1.82  1.04

### Step 5. Assign the columns as below:

The attributes are (dontated by Riccardo Leardi, riclea '@' anchem.unige.it):  
1) alcohol  
2) malic_acid  
3) alcalinity_of_ash  
4) magnesium  
5) flavanoids  
6) proanthocyanins  
7) hue

In [6]:
wine.rename(columns = {1:'alcohol', 2:'malic_acid', 4:'alcalinity_of_ash', 5:'magnesium', 
              7:'flavanoids', 9:'proanthocyanins', 11:'hue'},inplace=True)

In [7]:
wine.head()

,alcohol,malic_acid,alcalinity_of_ash,magnesium,flavanoids,proanthocyanins,hue
0,14.23,1.71,15.6,127,3.06,2.29,1.04
1,13.20,1.78,11.2,100,2.76,1.28,1.05
2,13.16,2.36,18.6,101,3.24,2.81,1.03
3,14.37,1.95,16.8,113,3.49,2.18,0.86
4,13.24,2.59,21.0,118,2.69,1.82,1.04

### Step 6. Set the values of the first 3 values from alcohol column as NaN

In [8]:
wine.alcohol[0:3]

0    14.23
1    13.20
2    13.16
Name: alcohol, dtype: float64

In [9]:
wine.loc[:2,'alcohol'] =np.nan

In [10]:
wine.alcohol.head()

0      NaN
1      NaN
2      NaN
3    14.37
4    13.24
Name: alcohol, dtype: float64

### Step 7. Now set the value of the rows 3 and 4 of magnesium as NaN

In [11]:
wine.magnesium[3:5]

3    113
4    118
Name: magnesium, dtype: int64

In [12]:
wine.loc[3:4,'magnesium'] = np.nan

In [13]:
wine.magnesium.head()

0    127.0
1    100.0
2    101.0
3      NaN
4      NaN
Name: magnesium, dtype: float64

### Step 8. Fill the value of NaN with the number 10 in alcohol and 100 in magnesium

In [14]:
wine.alcohol.isnull()

0       True
1       True
2       True
3      False
4      False
       ...
173    False
174    False
175    False
176    False
177    False
Name: alcohol, Length: 178, dtype: bool

In [15]:
wine.alcohol.fillna(value = 10 , inplace=True)

In [16]:
wine.alcohol.head()

0    10.00
1    10.00
2    10.00
3    14.37
4    13.24
Name: alcohol, dtype: float64

In [17]:
wine.magnesium[wine.magnesium.isnull()]

3   NaN
4   NaN
Name: magnesium, dtype: float64

In [18]:
wine.magnesium.fillna(100, inplace=True)

In [20]:
wine.magnesium.head()

0    127.0
1    100.0
2    101.0
3    100.0
4    100.0
Name: magnesium, dtype: float64

### Step 9. Count the number of missing values in all columns.

In [23]:
wine.isnull().sum()

alcohol              0
malic_acid           0
alcalinity_of_ash    0
magnesium            0
flavanoids           0
proanthocyanins      0
hue                  0
dtype: int64

### Step 10.  Create an array of 10 random numbers up until 10 and save it.

In [28]:
arr1 = np.random.randint(1,11,10)

In [29]:
arr1

array([9, 5, 7, 1, 9, 2, 4, 5, 5, 9])

### Step 11.  Set the rows corresponding to the random numbers to NaN in the column *alcohol*

In [52]:
wine.alcohol[[1,2,4,5,7,9]]

1    10.00
2    10.00
4    13.24
5    14.20
7    14.06
9    13.86
Name: alcohol, dtype: float64

In [54]:
wine.iloc[[1,2,4,5,7,9],:1] = np.nan

### Step 12.  How many missing values do we have now?

In [56]:
wine.alcohol.isnull().sum()

6

### Step 14. Print only the non-null values in alcohol

In [57]:
wine.alcohol[wine.alcohol.isnull()== False]

0      10.00
3      14.37
6      14.39
8      14.83
10     14.10
       ...
173    13.71
174    13.40
175    13.27
176    13.17
177    14.13
Name: alcohol, Length: 172, dtype: float64

### Step 13. Delete the rows that contain missing values

In [63]:
wine.drop(index=[1,2,4,5,7,9],inplace=True)

In [64]:
wine.head()

,alcohol,malic_acid,alcalinity_of_ash,magnesium,flavanoids,proanthocyanins,hue
0,10.00,1.71,15.6,127.0,3.06,2.29,1.04
3,14.37,1.95,16.8,100.0,3.49,2.18,0.86
6,14.39,1.87,14.6,96.0,2.52,1.98,1.02
8,14.83,1.64,14.0,97.0,2.98,1.98,1.08
10,14.10,2.16,18.0,105.0,3.32,2.38,1.25

### Step 15.  Reset the index, so it starts with 0 again

In [67]:
wine.reset_index(drop=True)

,alcohol,malic_acid,alcalinity_of_ash,magnesium,flavanoids,proanthocyanins,hue
0,10.00,1.71,15.6,127.0,3.06,2.29,1.04
1,14.37,1.95,16.8,100.0,3.49,2.18,0.86
2,14.39,1.87,14.6,96.0,2.52,1.98,1.02
3,14.83,1.64,14.0,97.0,2.98,1.98,1.08
4,14.10,2.16,18.0,105.0,3.32,2.38,1.25
...,...,...,...,...,...,...,...
167,13.71,5.65,20.5,95.0,0.61,1.06,0.64
168,13.40,3.91,23.0,102.0,0.75,1.41,0.70
169,13.27,4.28,20.0,120.0,0.69,1.35,0.59
170,13.17,2.59,20.0,120.0,0.68,1.46,0.60
171,14.13,4.10,24.5,96.0,0.76,1.35,0.61